Revit 2026 API

# GroundConductorSizeSetInsert Method

---

Insert the specified GroundConductorSize into the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Insert(
	GroundConductorSize item
)
```
```vb
Public Overridable Function Insert (
	item As GroundConductorSize
) As Boolean
```
```cpp
public:
virtual bool Insert(
	GroundConductorSize^ item
)
```
```fsharp
abstract Insert :
        item : GroundConductorSize -> bool
override Insert :
        item : GroundConductorSize -> bool
```

#### Parameters

item GroundConductorSize
    The GroundConductorSize to be inserted into the set.

#### Return Value

BooleanReturns whether the GroundConductorSize was inserted into the set.

#### Reference

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace